# -*- coding: utf-8 -*-

from .table_cleaner import normalize_label


hebrew_label_to_key = {
    normalize_label(k): v
    for k, v in {
        'מרפסות - בנוסף לשטח העיקרי (מ"ר)': "balc_add",
        'שטחי בניה (מ"ר) / מתחת לכניסה הקובעת / שרות': "bld_b_svc",
        'שטחי בניה (מ"ר) / מתחת לכניסה הקובעת / עיקרי': "bld_b_mn",
        'שטחי בניה (מ"ר) / מעל הכניסה הקובעת / שרות': "bld_a_svc",
        'גודל מגרש (מ"ר) / מוחלט גודל מגרש': "plot_sqm",
        # גרסאות נוספות מתוך ה־PDF
        ')מ"ר( לשטח העיקרי מרפסות-בנוסף': "balc_add",
        ')מ"ר( שטחי בניה / מתחת לכניסה הקובעת / שרות': "bld_b_svc",
        ')מ"ר( שטחי בניה / מתחת לכניסה הקובעת / עיקרי': "bld_b_mn",
        ')מ"ר( שטחי בניה / מעל הכניסה הקובעת / שרות': "bld_a_svc",
        ')מ"ר( גודל מגרש / מוחלט גודל מגרש': "plot_sqm",
        'מגורים (יח"ד)': "res_units",
        "מספר קומות / הקובעת מתחת לכניסה": "flr_below",
        "מספר קומות / הקובעת מעל הכניסה": "flr_above",
        "יעוד": "use_type",
        "שימוש": "use_func",
        "תאי שטח": "plot_cell",
        "בניין / מקום": "bldg_loc",
        'גודל מגרש (מ"ר)': "plot_sqm",
        'שטחי בניה (מ"ר) / מעל הכניסה הקובעת / עיקרי': "bldg_abv",
        'שטחי בניה (מ"ר) / מתחת הכניסה הקובעת / עיקרי': "bldg_blw",
        'שטחי בניה (מ"ר) / מתחת הכניסה הקובעת / שרות': "svc_blw",
        "תכסית (% מתא שטח)": "cover_pct",
        'מספר יח"ד': "unit_num",
        "גובה מבנה - מעל הכניסה הקובעת (מטר)": "bldg_ht",
        "מספר קומות מעל הכניסה הקובעת": "flr_abv",
        "מספר קומות מתחת לכניסה הקובעת": "flr_blw",
        "קו בנין (מטר) צידי ימני": "set_rgt",
        "קו בנין (מטר) צידי שמאלי": "set_lft",
        "קו בנין (מטר) אחורי": "set_rear",
        "קו בנין (מטר) קדמי": "set_frnt",
        # נתונים נוספים (מסך ראשי)
        'מגורים (מ"ר)': "residential_sqm",
        'מסחר (מ"ר)': "commercial_sqm",
        'תעסוקה (מ"ר)': "employment_sqm",
        'מבני ציבור (מ"ר)': "public_bldg_sqm",
        "חדרי מלון / תיירות (חדר)": "hotel_rooms",
        'חדרי מלון / תיירות (מ"ר)': "hotel_sqm",
        'סה"כ שטח בדונם': "total_area_dunam",
        'דירות קטנות (יח"ד)': "small_residential_units",
        "ב - תחבורה - רק\"ל (מס' תחנות)": "lrt_station_count",
        'ב - תחבורה - רק"ל (ק"מ)': "lrt_km",
    }.items()
}
